In [102]:
import pandas as pd

In [111]:
import warnings
warnings.filterwarnings('ignore')

In [112]:
d = {"Age":[12,23,35,46,58,74],"City":["New York","Adana","London","Beirut","Sydney","Edinburgh"],"Name":["John","Mike","Charles","Johannes","Alp","David"]}

In [113]:
df = pd.DataFrame(d)

In [114]:
df.head()

   Age      City      Name
0   12  New York      John
1   23     Adana      Mike
2   35    London   Charles
3   46    Beirut  Johannes
4   58    Sydney       Alp

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     6 non-null      int64
 1   City    6 non-null      object
 2   Name    6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [116]:
df = pd.DataFrame(d)

In [117]:
for a in df.columns:
    if df[a].dtype != "int64":
        for b in df[a].unique():
            df[b] = 0
            for c in range(len(df)):
                if df[a][c] == b:
                    df[b][c] = 1
                else:
                    df[b][c] = 0
        df.drop(columns=[a],inplace=True)

In [118]:
df

,Age,New York,Adana,London,Beirut,Sydney,Edinburgh,John,Mike,Charles,Johannes,Alp,David
0,12,1,0,0,0,0,0,1,0,0,0,0,0
1,23,0,1,0,0,0,0,0,1,0,0,0,0
2,35,0,0,1,0,0,0,0,0,1,0,0,0
3,46,0,0,0,1,0,0,0,0,0,1,0,0
4,58,0,0,0,0,1,0,0,0,0,0,1,0
5,74,0,0,0,0,0,1,0,0,0,0,0,1